tap "ariga/tap"
tap "bufbuild/buf"
tap "erha19/tap"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "stripe/stripe-cli"
brew "awscli"
brew "node"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "grpcurl"
brew "infracost"
brew "jq"
brew "k9s"
brew "llvm"
brew "localstack"
brew "lsusb"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "postgresql@18", link: true
brew "protobuf"
brew "qemu"
brew "rustup"
brew "sl"
brew "smartmontools"
brew "swiftlint"
brew "telnet"
brew "tesseract"
brew "tflint"
brew "tmux"
brew "uv"
brew "watchman"
brew "wget"
brew "wimlib"
brew "yq"
brew "yt-dlp"
brew "zig"
brew "zsh-autosuggestions"
brew "ariga/tap/atlas"
brew "bufbuild/buf/buf"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "1password-cli"
cask "claude"
cask "claude-code@latest"
cask "cloudflare-warp"
cask "codex"
cask "cyberduck"
cask "discord"
cask "discord@ptb"
cask "docker-desktop"
cask "flutter"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "gpg-suite"
cask "headlamp"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "minecraft"
cask "obs"
cask "prismlauncher"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zoom"
vscode "3w36zj6.textlint"
vscode "anthropic.claude-code"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-yaml"
vscode "tomoki1207.pdf"
go "golang.org/x/tools/cmd/goimports"
go "github.com/swaggo/swag/cmd/swag"
