# === Taps ===
tap "ariga/tap"
tap "bufbuild/buf"
tap "homebrew/services"
tap "stripe/stripe-cli"

# === CLI Tools ===
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "grpcurl"
brew "jq"
brew "llvm"
brew "lsusb"
brew "neovim"
brew "nmap"
brew "node"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "protobuf"
brew "qemu"
brew "rustup"
brew "sl"
brew "smartmontools"
brew "swiftlint"
brew "telnet"
brew "terraform"
brew "tesseract"
brew "tmux"
brew "uv"
brew "watchman"
brew "wget"
brew "wimlib"
brew "yt-dlp"
brew "zig"
brew "zsh-autosuggestions"

# === Java ===
brew "openjdk"

# === Database ===
brew "postgresql"

# === Third-party formulae ===
brew "ariga/tap/atlas"
brew "bufbuild/buf/buf"
brew "stripe/stripe-cli/stripe"

# === Casks ===
cask "1password"
cask "1password-cli"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "cyberduck"
cask "discord"
cask "discord@ptb"
cask "docker-desktop"
cask "flutter"
cask "ghostty"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "logi-options+"
cask "minecraft"
cask "obs"
cask "prismlauncher"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "xld"
cask "zoom"
